Repository: jrajaniemi/BikeComputerSwiftUI
Catalog: BikeComputer/Components/Localizable.xcstrings
Source language: en
Languages: ar, bg, bs, ca, cs, da, de, el, es, et, fi, fr, ga, ga_ie, ha, he, hi, hr, hu, hy, id, is, it, ja, ka, ko, ku, la, lt, lv, mk, ms, mt, nb, nl, pa, pl, pt, pt_pt, qu, rm, rm_ch, ro, ru, sk, sl, sq, sr, sv, sw, th, tr, uk_ua, ur, vi, zh, zh_hant

source: The Auto-Record feature automatically starts recording your routes when start moving. This means you do not have to remember to start recording when you begin moving. However, Auto-Record only works when the app is starts up.
ar: تعمل ميزة التسجيل التلقائي على بدء تسجيل مساراتك تلقائيًا عند بدء التحرك. هذا يعني أنك لست بحاجة إلى تذكر بدء التسجيل عند بدء التحرك. ومع ذلك، تعمل ميزة التسجيل التلقائي فقط عندما يتم تشغيل التطبيق.
bg: Функцията за автоматичен запис автоматично започва записването на вашите маршрути, когато започнете да се движите. Това означава, че не е нужно да помните да започнете запис, когато започнете да се движите. Въпреки това, автоматичният запис работи само когато приложението е стартирано.
bs: Funkcija automatskog snimanja automatski počinje snimati vaše rute kada počnete kretati. To znači da ne morate pamtiti da započnete snimanje kada počnete kretati. Međutim, automatsko snimanje radi samo kada se aplikacija pokrene.
ca: La funció Auto-Record comença automàticament a enregistrar les teves rutes quan comences a moure't. Això vol dir que no has de recordar-te de començar a enregistrar quan comences a moure't. Tanmateix, Auto-Record només funciona quan l'aplicació s'inicia.
cs: Funkce automatického záznamu automaticky spustí nahrávání tras při zahájení pohybu. To znamená, že si nemusíte pamatovat, abyste při zahájení pohybu spustili nahrávání. Nicméně, automatický záznam funguje pouze při spuštění aplikace.
da: Funktionen Auto-Record begynder automatisk at optage dine ruter, når du begynder at bevæge dig. Dette betyder, at du ikke behøver at huske at starte optagelsen, når du begynder at bevæge dig. Dog fungerer Auto-Record kun, når appen starter op.
de: Die Funktion Auto-Record startet automatisch die Aufzeichnung Ihrer Routen, wenn Sie sich zu bewegen beginnen. Das bedeutet, dass Sie nicht daran denken müssen, die Aufzeichnung zu starten, wenn Sie sich in Bewegung setzen. Allerdings funktioniert Auto-Record nur, wenn die App gestartet wird.
el: Η λειτουργία Auto-Record ξεκινά αυτόματα την καταγραφή των διαδρομών σας όταν αρχίσετε να κινείστε. Αυτό σημαίνει ότι δεν χρειάζεται να θυμάστε να ξεκινήσετε την καταγραφή όταν αρχίσετε να κινείστε. Ωστόσο, η Auto-Record λειτουργεί μόνο όταν η εφαρμογή ξεκινά.
es: La función de Auto-Grabación comienza a grabar automáticamente tus rutas cuando empiezas a moverte. Esto significa que no tienes que recordar iniciar la grabación cuando empiezas a moverte. Sin embargo, Auto-Grabación solo funciona cuando la aplicación se inicia.
et: Automaatne salvestamise funktsioon alustab automaatselt marsruutide salvestamist, kui hakkate liikuma. See tähendab, et te ei pea meeles pidama salvestamise alustamist, kui hakkate liikuma. Kuid automaatne salvestamine töötab ainult siis, kui rakendus käivitub.
fi: Automaattinen tallennustoiminto käynnistää reittien tallennuksen automaattisesti, kun alat liikkua. Tämä tarkoittaa, että sinun ei tarvitse muistaa aloittaa tallennusta, kun lähdet liikkeelle. Kuitenkin, Automaattitallennus toimii vain, kun sovellus käynnistyy.
fr: La fonction Enregistrement-Auto commence automatiquement l'enregistrement de vos itinéraires lorsque vous commencez à vous déplacer. Cela signifie que vous n'avez pas à vous souvenir de commencer l'enregistrement lorsque vous commencez à bouger. Cependant, l'Enregistrement-Auto ne fonctionne que lorsque l'application démarre.
ga: Tosaíonn an ghné Auto-Record ag taifeadadh do bhealaí go huathoibríoch nuair a thosaíonn tú ag bogadh. Ciallaíonn sé seo nach gá duit cuimhneamh ar thosú ag taifeadadh nuair a thosaíonn tú ag bogadh. Mar sin féin, ní oibríonn Auto-Record ach nuair a thosaíonn an aip suas.
ga_ie: Tosaíonn an ghné Auto-Record ag taifeadadh do bhealaí go huathoibríoch nuair a thosaíonn tú ag bogadh. Ciallaíonn sé seo nach gá duit cuimhneamh ar thosach a chur leis an taifeadadh nuair a thosaíonn tú ag bogadh. Mar sin féin, ní oibríonn Auto-Record ach nuair a chuirtear tús leis an aip.
ha: Fasalin Auto-Record yana fara ɗaukar bayanan lokutan hanyarku ta atomatik lokacin da kake farawa motsawa. Wannan yana nufin ba dole ka tuna da yin rikodin lokacin da kake farawa motsawa. Duk da haka, Auto-Record yana aiki ne kawai lokacin da aka kunna manhajar.
he: תכונת ההקלטה האוטומטית מתחילה להקליט את המסלולים שלך באופן אוטומטי כשאתה מתחיל לזוז. משמעות הדבר היא שאין צורך לזכור להתחיל להקליט כשמתחילים לזוז. עם זאת, ההקלטה האוטומטית פועלת רק כשהאפליקציה מופעלת.
hi: ऑटो-रिकॉर्ड फीचर अपने आप आपके मार्गों को रिकॉर्ड करना शुरू कर देता है जब आप चलना शुरू करते हैं। इसका मतलब है कि जब आप चलना शुरू करते हैं, तो आपको रिकॉर्डिंग शुरू करने को याद नहीं रखना पड़ता। हालांकि, ऑटो-रिकॉर्ड केवल तब काम करता है जब ऐप चालू होता है।
hr: Značajka automatskog snimanja automatski počinje snimati vaše rute kada počnete kretati. To znači da ne morate pamtiti započeti snimanje kada se počnete kretati. Međutim, automatsko snimanje radi samo kada se aplikacija pokrene.
hu: Az automatikus felvétel funkció automatikusan elindítja útvonalainak rögzítését, amikor elindul. Ez azt jelenti, hogy nem kell emlékeznie arra, hogy elindítsd a felvételt, amikor elindulsz. Azonban az automatikus felvétel csak akkor működik, amikor az alkalmazás elindul.
hy: Ավտո-ձայնագրման գործառույթն ավտոմատ կերպով սկսում է ձայնագրել ձեր երթուղիները, երբ սկսում եք շարժվել: Սա նշանակում է, որ դուք չեք ստիպված հիշելու սկսել ձայնագրումը, երբ սկսում եք շարժվել: Սակայն, Ավտո-ձայնագրումն աշխատում է միայն ծրագիրը սկսելիս:
id: Fitur Auto-Record secara otomatis mulai merekam rute Anda saat mulai bergerak. Ini berarti Anda tidak perlu ingat untuk mulai merekam saat Anda mulai bergerak. Namun, Auto-Record hanya berfungsi saat aplikasi mulai dijalankan.
is: Sjálfvirk upptaka virknin byrjar sjálfkrafa að taka upp leiðir þínar þegar þú byrjar að hreyfa þig. Þetta þýðir að þú þarft ekki að muna að byrja upptöku þegar þú byrjar að hreyfa þig. Hins vegar virkar sjálfvirk upptaka aðeins þegar forritið er ræst.
it: La funzione Auto-Record avvia automaticamente la registrazione dei tuoi percorsi quando inizi a muoverti. Questo significa che non devi ricordarti di avviare la registrazione quando inizi a muoverti. Tuttavia, Auto-Record funziona solo quando l'app viene avviata.
ja: 自動記録機能は、動き始めるとルートの記録を自動的に開始します。これは、動き始めたときに記録を開始することを覚えておく必要がないことを意味します。ただし、自動記録はアプリが起動しているときにのみ動作します。
ka: ავტო-ჩაწერის ფუნქცია ავტომატურად იწყებს თქვენი მარშრუტების ჩაწერას, როდესაც მოძრაობას იწყებთ. ეს ნიშნავს, რომ არ გჭირდებათ გახსოვდეთ ჩაწერა, როდესაც მოძრაობას იწყებთ. თუმცა, ავტო-ჩაწერა მუშაობს მხოლოდ მაშინ, როდესაც აპლიკაცია ჩართულია.
ko: 자동 기록 기능은 이동을 시작할 때 경로 녹화를 자동으로 시작합니다. 이는 이동을 시작할 때 녹화를 시작할 것을 기억할 필요가 없다는 것을 의미합니다. 그러나 자동 기록은 앱이 시작될 때만 작동합니다.
ku: تایبەتمەندی فیدی تەمەنی ئۆتۆماتیکی دەستپێ دەکات بە تەنها دەرسکرنی ڕێڕەوەکانت کاتێک دەستپێ دەکەی بە جوڵاندن. ئەمە واتە پێویست نیە هەست بکەی بە دەستپێکردنی دەرسکرن کاتێک دەستپێدەکەیت بە جوڵاندن. بەڵام، تایبەتمەنی ئۆتۆماتیکی تەنها کاتێک کار دەکات کە ئەپەکە دەستپێ دەکات.
la: Auto-Record munus sponte incipit itinera tua recordari cum movere incipis. Hoc significat te non debere recordari ad incipere recordationem cum movere incipis. Tamen, Auto-Record solum operatur cum app initium accipit.
lt: Automatinio įrašymo funkcija automatiškai pradeda įrašinėti jūsų maršrutus, kai pradedate judėti. Tai reiškia, kad jums nereikės prisiminti, kada pradėti įrašymą. Tačiau automatinis įrašymas veikia tik tada, kai programa yra paleista.
lv: Auto-ierakstīšanas funkcija automātiski sāk ierakstīt jūsu maršrutus, kad sākat kustēties. Tas nozīmē, ka jums nav jāatceras sākt ierakstīšanu, kad sākat kustēties. Tomēr Auto-ieraksts darbojas tikai tad, kad lietotne ir palaista.
mk: Функцијата Авто-Снимање автоматски започнува со снимање на вашите патеки кога започнувате да се движите. Ова значи дека не мора да се сеќавате да започнете со снимање кога почнувате да се движите. Меѓутоа, Авто-Снимање работи само кога апликацијата се вклучува.
ms: Ciri Rakaman-Auto mula merakam laluan anda secara automatik apabila mula bergerak. Ini bermakna anda tidak perlu ingat untuk mula merakam apabila anda mula bergerak. Walau bagaimanapun, Rakaman-Auto hanya berfungsi apabila aplikasi dimulakan.
mt: Il-karatteristika Auto-Record tibda awtomatikament tirreġistra l-rotot tiegħek meta tibda tiċċaqlaq. Dan ifisser li m'għandekx bżonn tiftakar biex tibda tirreġistra meta tibda tiċċaqlaq. Madankollu, Auto-Record jaħdem biss meta l-app tibda.
nb: Auto-Record-funksjonen starter automatisk opptak av rutene dine når du begynner å bevege deg. Dette betyr at du ikke trenger å huske å starte opptak når du begynner å bevege deg. Men Auto-Record fungerer kun når appen starter opp.
nl: De Auto-Record functie start automatisch met opnemen van je routes wanneer je begint te bewegen. Dit betekent dat je niet hoeft te onthouden om het opnemen te starten wanneer je begint te bewegen. Echter, Auto-Record werkt alleen wanneer de app wordt opgestart.
pa: ਆਟੋ-ਰਿਕਾਰਡ ਫੀਚਰ ਆਪਣੇ ਰਸਤੇ ਰਿਕਾਰਡ ਕਰਨਾ ਆਪਣੇ ਆਪ ਅੱਗੇ ਵਧਦੇ ਹੋਇਆਂ ਸ਼ੁਰੂ ਕਰ ਦਿੰਦਾ ਹੈ। ਇਸਦਾ ਮਤਲਬ ਹੈ ਕਿ ਤੁਹਾਨੂੰ ਯਾਦ ਨਹੀਂ ਰੱਖਣਾ ਪਵੇਗਾ ਜਦੋਂ ਤੁਸੀਂ ਚਲਣਾ ਸ਼ੁਰੂ ਕਰਦੇ ਹੋ ਤਾਂ ਰਿਕਾਰਡਿੰਗ ਸ਼ੁਰੂ ਕਰੋ। ਹਾਲਾਂਕਿ, ਆਟੋ-ਰਿਕਾਰਡ ਤਦ ਹੀ ਕੰਮ ਕਰਦਾ ਹੈ ਜਦੋਂ ਐਪ ਸ਼ੁਰੂ ਹੁੰਦੀ ਹੈ।
pl: Funkcja Auto-Record automatycznie rozpoczyna nagrywanie tras, gdy zaczynasz się poruszać. Oznacza to, że nie musisz pamiętać o rozpoczęciu nagrywania, gdy zaczynasz się poruszać. Jednak Auto-Record działa tylko wtedy, gdy aplikacja jest uruchomiona.
pt: O recurso de Gravação Automática começa a gravar suas rotas automaticamente quando você começa a se mover. Isso significa que você não precisa se lembrar de iniciar a gravação quando começar a se mover. No entanto, a Gravação Automática só funciona quando o aplicativo é iniciado.
pt_pt: A funcionalidade de Gravação Automática começa a gravar as suas rotas automaticamente quando começa a movimentar-se. Isto significa que não precisa de se lembrar de iniciar a gravação quando começa a movimentar-se. No entanto, a Gravação Automática só funciona quando a aplicação é iniciada.
qu: Auto-Record munan ñit'iyta suyakuyta ñanqayki qallarinqa rikhuykuy ñanqaykita. Tukuy kunanqa ama kuyakuy allinayta ñit'iyta qallarinqa rikhuykuyta. Ichapas, Auto-Record llank'ani waqaychaypi qallarichkan chaykunapuni.
rm: La funcziun Auto-Record cumenza automaticamain a registrar tias rutas cura che ti entschaiva a sa mover. Quai munta che ti na stos betg sa regurdar dad entscheiver a registrar cura che ti entschaiva a sa mover. Denton, Auto-Record funcziuna mo cura che l'applicaziun vegn avierta.
rm_ch: La funcziun Auto-Record entschaiva automaticamain a registrar tias rutas cura che ti entschaivas a muventar. Quai vul dir che ti na stos betg sa regordar dad entschaiver a registrar cura che ti entschaivas a muventar. Denton, Auto-Record funcziuna mo cura che l'app è avierta.
ro: Funcția Auto-Record începe automat înregistrarea traseelor tale când pornești. Acest lucru înseamnă că nu trebuie să îți amintești să începi înregistrarea când începi să te miști. Totuși, Auto-Record funcționează doar când aplicația este pornită.
ru: Функция Автозаписи автоматически начинает запись ваших маршрутов при начале движения. Это значит, что вам не нужно помнить о начале записи при начале движения. Однако Автозапись работает только при запуске приложения.
sk: Funkcia Auto-Record automaticky začne nahrávať vaše trasy, keď sa začnete pohybovať. To znamená, že si nemusíte pamätať, aby ste začali nahrávať, keď sa začnete hýbať. Funkcia Auto-Record však funguje iba vtedy, keď sa aplikácia spustí.
sl: Funkcija Samodejno-Snemanje samodejno začne snemati vaše poti, ko se začnete premikati. To pomeni, da se vam ni treba spomniti, da začnete snemati, ko se začnete premikati. Vendar pa Samodejno-Snemanje deluje le, ko se aplikacija zažene.
sq: Funksioni Auto-Record fillon automatikisht regjistrimin e rrugëve tuaja kur filloni të lëvizni. Kjo do të thotë që nuk keni nevojë të mbani mend për të filluar regjistrimin kur filloni të lëvizni. Megjithatë, Auto-Record funksionon vetëm kur aplikacioni fillon.
sr: Funkcija automatskog snimanja automatski počinje beleženje vaših ruta kada se počnete kretati. To znači da ne morate pamtiti da započnete snimanje kada se počnete kretati. Međutim, automatsko snimanje radi samo kada se aplikacija pokrene.
sv: Funktionen Auto-Record börjar automatiskt spela in dina rutter när du börjar röra dig. Detta betyder att du inte behöver komma ihåg att starta inspelningen när du börjar röra dig. Dock fungerar Auto-Record endast när appen startas upp.
sw: Kipengele cha Kurekodi Kiotomatiki huanza kurekodi njia zako kiotomatisi unapoanza kusonga. Hii inamaanisha hauhitaji kukumbuka kuanza kurekodi unapoanza kusonga. Hata hivyo, Kurekodi Kiotomatiki hufanya kazi tu wakati programu inapowashwa.
th: การบันทึกอัตโนมัติจะเริ่มบันทึกเส้นทางของคุณเมื่อเริ่มเคลื่อนที่โดยอัตโนมัติ ซึ่งหมายความว่าคุณไม่ต้องจำหรือเริ่มบันทึกเมื่อคุณเริ่มเคลื่อนที่ อย่างไรก็ตาม การบันทึกอัตโนมัติจะใช้งานได้เฉพาะเมื่อเปิดแอปเท่านั้น
tr: Otomatik Kayıt özelliği, hareket etmeye başladığınızda rotalarınızı otomatik olarak kaydetmeye başlar. Bu, hareket etmeye başladığınızda kaydı başlatmayı hatırlamanız gerekmediği anlamına gelir. Ancak, Otomatik Kayıt yalnızca uygulama başladığında çalışır.
uk_ua: Функція автоматичного запису автоматично починає запис ваших маршрутів, коли ви починаєте рухатися. Це означає, що вам не потрібно пам’ятати про початок запису під час початку руху. Однак автоматичний запис працює лише при запуску додатку.
ur: آٹو ریکارڈ فیچر خود بخود آپ کے راستے ریکارڈ کرنا شروع کر دیتا ہے جب آپ حرکت کرتے ہیں۔ اس کا مطلب ہے کہ آپ کو ریکارڈنگ شروع کرنے یاد رکھنے کی ضرورت نہیں ہے۔ تاہم، آٹو ریکارڈ صرف ایپ شروع ہونے پر کام کرتا ہے۔
vi: Tính năng Ghi tự động sẽ tự động bắt đầu ghi lại lộ trình của bạn khi bắt đầu di chuyển. Điều này có nghĩa là bạn không phải nhớ để bắt đầu ghi khi bạn bắt đầu di chuyển. Tuy nhiên, Ghi tự động chỉ hoạt động khi ứng dụng khởi động.
zh: 自动记录功能会在您开始移动时自动开始记录路线。这意味着您无需记得在开始移动时开始记录。不过，自动记录仅在应用程序启动时有效。
zh_hant: 自動記錄功能在你開始移動時自動開始記錄路線。這意味著你不必記住在開始移動時開始記錄。然而，自動記錄僅在應用程式啟動時才有效。
